app/controllers/posts_controller.rb

  def new
    if params[:author_id] && !Author.exists?(params[:author_id]) #to see if the author is real.
      redirect_to authors_path, alert: "Author not found."
---
SELECT  1 AS one FROM "authors" LIMIT 1
SELECT "authors".* FROM "authors"